[Killed] BlockStatement
src/utils/safe-stringify.ts:9:64
 /**
  * Serialize an error object to a plain object with all relevant properties
  */
-function serializeError(error: Error): Record<string, unknown> {
-	return {
-		message: error.message,
-		name: error.name,
-		stack: error.stack,
-		// Include any additional enumerable properties
-		...Object.getOwnPropertyNames(error)
-			.filter((key) => key !== "message" && key !== "name" && key !== "stack")
-			.reduce(
-				(acc, key) => {
-					acc[key] = (error as unknown as Record<string, unknown>)[key]
-					return acc
-				},
-				{} as Record<string, unknown>,
-			),
-	}
-}
+function serializeError(error: Error): Record<string, unknown> {}
 
 /**
killedBy: All tests
statusReason: RUN  v4.0.17 C:/Users/echernyavsky/Documents/AlfaCode assistants/packages/agent-runtime/.stryker-tmp/sandbox-xgAkYD



 ❯ src/utils/__tests__/safe-stringify.test.ts (29 tests | 4 failed) 19ms

       ✓ should return null as-is 2ms
       ✓ should return undefined as-is 0ms

[Killed] MethodExpression
src/utils/safe-stringify.ts:15:6
 		name: error.name,
 		stack: error.stack,
 		// Include any additional enumerable properties
-		...Object.getOwnPropertyNames(error)
-			.filter((key) => key !== "message" && key !== "name" && key !== "stack")
+		...Object.getOwnPropertyNames(error)
 			.reduce(
 				(acc, key) => {
killedBy: All tests
statusReason: RUN  v4.0.17 C:/Users/echernyavsky/Documents/AlfaCode assistants/packages/agent-runtime/.stryker-tmp/sandbox-xgAkYD



 ❯ src/utils/__tests__/safe-stringify.test.ts (29 tests | 1 failed) 25ms

       ✓ should return null as-is 2ms

[Killed] LogicalOperator
src/utils/safe-stringify.ts:16:21
 		stack: error.stack,
 		// Include any additional enumerable properties
 		...Object.getOwnPropertyNames(error)
-			.filter((key) => key !== "message" && key !== "name" && key !== "stack")
+			.filter((key) => key !== "message" || key !== "name" && key !== "stack")
 			.reduce(
 				(acc, key) => {
killedBy: All tests
statusReason: RUN  v4.0.17 C:/Users/echernyavsky/Documents/AlfaCode assistants/packages/agent-runtime/.stryker-tmp/sandbox-xgAkYD


 ❯ src/utils/__tests__/safe-stringify.test.ts (29 tests | 1 failed) 18ms

       ✓ should return null as-is 1ms
       ✓ should return undefined as-is 0ms
       ✓ should return strings as-is 0ms

[Killed] ArrowFunction
src/utils/safe-stringify.ts:16:12
 		stack: error.stack,
 		// Include any additional enumerable properties
 		...Object.getOwnPropertyNames(error)
-			.filter((key) => key !== "message" && key !== "name" && key !== "stack")
+			.filter(() => undefined)
 			.reduce(
 				(acc, key) => {
killedBy: All tests
statusReason: RUN  v4.0.17 C:/Users/echernyavsky/Documents/AlfaCode assistants/packages/agent-runtime/.stryker-tmp/sandbox-xgAkYD



 ❯ src/utils/__tests__/safe-stringify.test.ts (29 tests | 1 failed) 15ms

       ✓ should return null as-is 1ms
       ✓ should return undefined as-is 0ms

[Killed] BlockStatement
src/utils/safe-stringify.ts:18:19
 		...Object.getOwnPropertyNames(error)
 			.filter((key) => key !== "message" && key !== "name" && key !== "stack")
 			.reduce(
-				(acc, key) => {
-					acc[key] = (error as unknown as Record<string, unknown>)[key]
-					return acc
-				},
+				(acc, key) => {},
 				{} as Record<string, unknown>,
 			),
killedBy: All tests
statusReason: RUN  v4.0.17 C:/Users/echernyavsky/Documents/AlfaCode assistants/packages/agent-runtime/.stryker-tmp/sandbox-xgAkYD



 ❯ src/utils/__tests__/safe-stringify.test.ts (29 tests | 1 failed) 22ms

       ✓ should return null as-is 1ms
       ✓ should return undefined as-is 0ms

[Killed] EqualityOperator
src/utils/safe-stringify.ts:33:22
  */
 export function safeStringify(obj: unknown, seen = new WeakSet()): unknown {
 	// Handle primitives
-	if (obj === null || typeof obj !== "object") {
+	if (obj === null || typeof obj === "object") {
 		return obj
 	}
killedBy: All tests
statusReason: RUN  v4.0.17 C:/Users/echernyavsky/Documents/AlfaCode assistants/packages/agent-runtime/.stryker-tmp/sandbox-xgAkYD



 ❯ src/utils/__tests__/safe-stringify.test.ts (29 tests | 14 failed) 34ms

       ✓ should return null as-is 2ms
       × should return undefined as-is 5ms

[Killed] BlockStatement
src/utils/safe-stringify.ts:33:47
  */
 export function safeStringify(obj: unknown, seen = new WeakSet()): unknown {
 	// Handle primitives
-	if (obj === null || typeof obj !== "object") {
-		return obj
-	}
+	if (obj === null || typeof obj !== "object") {}
 
 	// Handle circular references
killedBy: All tests
statusReason: RUN  v4.0.17 C:/Users/echernyavsky/Documents/AlfaCode assistants/packages/agent-runtime/.stryker-tmp/sandbox-xgAkYD



 ❯ src/utils/__tests__/safe-stringify.test.ts (29 tests | 18 failed) 31ms

       × should return null as-is 5ms

[Killed] ConditionalExpression
src/utils/safe-stringify.ts:38:6
 	}
 
 	// Handle circular references
-	if (seen.has(obj as object)) {
+	if (false) {
 		return "[Circular]"
 	}
killedBy: All tests
statusReason: RUN  v4.0.17 C:/Users/echernyavsky/Documents/AlfaCode assistants/packages/agent-runtime/.stryker-tmp/sandbox-xgAkYD



 ❯ src/utils/__tests__/safe-stringify.test.ts (29 tests | 4 failed) 82ms

       ✓ should return null as-is 1ms
       ✓ should return undefined as-is 0ms

[Killed] BlockStatement
src/utils/safe-stringify.ts:38:31
 	}
 
 	// Handle circular references
-	if (seen.has(obj as object)) {
-		return "[Circular]"
-	}
+	if (seen.has(obj as object)) {}
 
 	// Handle Error objects
killedBy: All tests
statusReason: RUN  v4.0.17 C:/Users/echernyavsky/Documents/AlfaCode assistants/packages/agent-runtime/.stryker-tmp/sandbox-xgAkYD



 ❯ src/utils/__tests__/safe-stringify.test.ts (29 tests | 4 failed) 77ms

       ✓ should return null as-is 1ms
       ✓ should return undefined as-is 0ms

[Killed] BlockStatement
src/utils/safe-stringify.ts:43:28
 	}
 
 	// Handle Error objects
-	if (obj instanceof Error) {
-		return serializeError(obj)
-	}
+	if (obj instanceof Error) {}
 
 	// Handle arrays
killedBy: All tests
statusReason: RUN  v4.0.17 C:/Users/echernyavsky/Documents/AlfaCode assistants/packages/agent-runtime/.stryker-tmp/sandbox-xgAkYD



 ❯ src/utils/__tests__/safe-stringify.test.ts (29 tests | 3 failed) 24ms

       ✓ should return null as-is 1ms
       ✓ should return undefined as-is 0ms

[Killed] ConditionalExpression
src/utils/safe-stringify.ts:43:6
 	}
 
 	// Handle Error objects
-	if (obj instanceof Error) {
+	if (false) {
 		return serializeError(obj)
 	}
killedBy: All tests
statusReason: RUN  v4.0.17 C:/Users/echernyavsky/Documents/AlfaCode assistants/packages/agent-runtime/.stryker-tmp/sandbox-xgAkYD



 ❯ src/utils/__tests__/safe-stringify.test.ts (29 tests | 3 failed) 18ms

       ✓ should return null as-is 1ms
       ✓ should return undefined as-is 0ms

[Killed] BlockStatement
src/utils/safe-stringify.ts:48:26
 	}
 
 	// Handle arrays
-	if (Array.isArray(obj)) {
-		seen.add(obj)
-		const result = obj.map((item) => safeStringify(item, seen))
-		seen.delete(obj)
-		return result
-	}
+	if (Array.isArray(obj)) {}
 
 	// Handle Date objects
killedBy: All tests
statusReason: RUN  v4.0.17 C:/Users/echernyavsky/Documents/AlfaCode assistants/packages/agent-runtime/.stryker-tmp/sandbox-xgAkYD



 ❯ src/utils/__tests__/safe-stringify.test.ts (29 tests | 4 failed) 27ms

       ✓ should return null as-is 2ms
       ✓ should return undefined as-is 0ms

[Killed] ConditionalExpression
src/utils/safe-stringify.ts:48:6
 	}
 
 	// Handle arrays
-	if (Array.isArray(obj)) {
+	if (true) {
 		seen.add(obj)
 		const result = obj.map((item) => safeStringify(item, seen))
killedBy: All tests
statusReason: RUN  v4.0.17 C:/Users/echernyavsky/Documents/AlfaCode assistants/packages/agent-runtime/.stryker-tmp/sandbox-xgAkYD



 ❯ src/utils/__tests__/safe-stringify.test.ts (29 tests | 11 failed) 21ms

       ✓ should return null as-is 1ms
       ✓ should return undefined as-is 0ms

[Killed] ArrowFunction
src/utils/safe-stringify.ts:50:26
 	// Handle arrays
 	if (Array.isArray(obj)) {
 		seen.add(obj)
-		const result = obj.map((item) => safeStringify(item, seen))
+		const result = obj.map(() => undefined)
 		seen.delete(obj)
 		return result
killedBy: All tests
statusReason: RUN  v4.0.17 C:/Users/echernyavsky/Documents/AlfaCode assistants/packages/agent-runtime/.stryker-tmp/sandbox-xgAkYD



 ❯ src/utils/__tests__/safe-stringify.test.ts (29 tests | 4 failed) 26ms

       ✓ should return null as-is 1ms
       ✓ should return undefined as-is 0ms

[Killed] BlockStatement
src/utils/safe-stringify.ts:56:27
 	}
 
 	// Handle Date objects
-	if (obj instanceof Date) {
-		return obj.toISOString()
-	}
+	if (obj instanceof Date) {}
 
 	// Handle RegExp objects
killedBy: All tests
statusReason: RUN  v4.0.17 C:/Users/echernyavsky/Documents/AlfaCode assistants/packages/agent-runtime/.stryker-tmp/sandbox-xgAkYD



 ❯ src/utils/__tests__/safe-stringify.test.ts (29 tests | 1 failed) 15ms

       ✓ should return null as-is 1ms

[Killed] ConditionalExpression
src/utils/safe-stringify.ts:56:6
 	}
 
 	// Handle Date objects
-	if (obj instanceof Date) {
+	if (false) {
 		return obj.toISOString()
 	}
killedBy: All tests
statusReason: RUN  v4.0.17 C:/Users/echernyavsky/Documents/AlfaCode assistants/packages/agent-runtime/.stryker-tmp/sandbox-xgAkYD



 ❯ src/utils/__tests__/safe-stringify.test.ts (29 tests | 1 failed) 25ms

       ✓ should return null as-is 3ms
       ✓ should return undefined as-is 0ms

[Killed] ConditionalExpression
src/utils/safe-stringify.ts:61:6
 	}
 
 	// Handle RegExp objects
-	if (obj instanceof RegExp) {
+	if (false) {
 		return obj.toString()
 	}
killedBy: All tests
statusReason: RUN  v4.0.17 C:/Users/echernyavsky/Documents/AlfaCode assistants/packages/agent-runtime/.stryker-tmp/sandbox-xgAkYD



 ❯ src/utils/__tests__/safe-stringify.test.ts (29 tests | 1 failed) 25ms

       ✓ should return null as-is 2ms

[Killed] ConditionalExpression
src/utils/safe-stringify.ts:61:6
 	}
 
 	// Handle RegExp objects
-	if (obj instanceof RegExp) {
+	if (true) {
 		return obj.toString()
 	}
killedBy: All tests
statusReason: RUN  v4.0.17 C:/Users/echernyavsky/Documents/AlfaCode assistants/packages/agent-runtime/.stryker-tmp/sandbox-xgAkYD



 ❯ src/utils/__tests__/safe-stringify.test.ts (29 tests | 9 failed) 23ms
       ✓ should return null as-is 1ms
       ✓ should return undefined as-is 0ms
       ✓ should return strings as-is 0ms

[Killed] BlockStatement
src/utils/safe-stringify.ts:68:50
 	// Handle plain objects
 	seen.add(obj)
 	const result: Record<string, unknown> = {}
-	for (const [key, value] of Object.entries(obj)) {
-		try {
-			result[key] = safeStringify(value, seen)
-		} catch (_error) {
-			// If serialization fails for a property, mark it
-			result[key] = "[Serialization Error]"
-		}
-	}
+	for (const [key, value] of Object.entries(obj)) {}
 	seen.delete(obj)
 	return result
killedBy: All tests
statusReason: RUN  v4.0.17 C:/Users/echernyavsky/Documents/AlfaCode assistants/packages/agent-runtime/.stryker-tmp/sandbox-xgAkYD



 ❯ src/utils/__tests__/safe-stringify.test.ts (29 tests | 9 failed) 25ms

       ✓ should return null as-is 2ms
       ✓ should return undefined as-is 0ms

[Killed] BlockStatement
src/utils/safe-stringify.ts:69:7
 	seen.add(obj)
 	const result: Record<string, unknown> = {}
 	for (const [key, value] of Object.entries(obj)) {
-		try {
-			result[key] = safeStringify(value, seen)
-		} catch (_error) {
+		try {} catch (_error) {
 			// If serialization fails for a property, mark it
 			result[key] = "[Serialization Error]"
killedBy: All tests
statusReason: RUN  v4.0.17 C:/Users/echernyavsky/Documents/AlfaCode assistants/packages/agent-runtime/.stryker-tmp/sandbox-xgAkYD



 ❯ src/utils/__tests__/safe-stringify.test.ts (29 tests | 9 failed) 30ms

       ✓ should return null as-is 3ms

[Killed] BlockStatement
src/utils/safe-stringify.ts:71:20
 	for (const [key, value] of Object.entries(obj)) {
 		try {
 			result[key] = safeStringify(value, seen)
-		} catch (_error) {
-			// If serialization fails for a property, mark it
-			result[key] = "[Serialization Error]"
-		}
+		} catch (_error) {}
 	}
 	seen.delete(obj)
killedBy: All tests
statusReason: RUN  v4.0.17 C:/Users/echernyavsky/Documents/AlfaCode assistants/packages/agent-runtime/.stryker-tmp/sandbox-xgAkYD



 ❯ src/utils/__tests__/safe-stringify.test.ts (29 tests | 1 failed) 27ms

       ✓ should return null as-is 2ms
       ✓ should return undefined as-is 0ms

[Killed] BlockStatement
src/utils/safe-stringify.ts:84:51
  * Convert an argument to a string representation, handling circular references
  * and special types. This is specifically designed for console logging.
  */
-export function argToString(arg: unknown): string {
-	if (typeof arg === "string") {
-		return arg
-	}
-
-	try {
-		const safe = safeStringify(arg)
-		return JSON.stringify(safe)
-	} catch (_error) {
-		// Fallback if even safe stringify fails
-		return "[Unable to stringify]"
-	}
-}
+export function argToString(arg: unknown): string {}
 
 /**
killedBy: All tests
statusReason: RUN  v4.0.17 C:/Users/echernyavsky/Documents/AlfaCode assistants/packages/agent-runtime/.stryker-tmp/sandbox-xgAkYD



 ❯ src/utils/__tests__/safe-stringify.test.ts (29 tests | 8 failed) 21ms

       ✓ should return null as-is 1ms
       ✓ should return undefined as-is 0ms

[Killed] ConditionalExpression
src/utils/safe-stringify.ts:85:6
  * and special types. This is specifically designed for console logging.
  */
 export function argToString(arg: unknown): string {
-	if (typeof arg === "string") {
+	if (false) {
 		return arg
 	}
killedBy: All tests
statusReason: RUN  v4.0.17 C:/Users/echernyavsky/Documents/AlfaCode assistants/packages/agent-runtime/.stryker-tmp/sandbox-xgAkYD



 ❯ src/utils/__tests__/safe-stringify.test.ts (29 tests | 4 failed) 27ms

       ✓ should return null as-is 2ms
       ✓ should return undefined as-is 0ms

[Killed] ConditionalExpression
src/utils/safe-stringify.ts:85:6
  * and special types. This is specifically designed for console logging.
  */
 export function argToString(arg: unknown): string {
-	if (typeof arg === "string") {
+	if (true) {
 		return arg
 	}
killedBy: All tests
statusReason: RUN  v4.0.17 C:/Users/echernyavsky/Documents/AlfaCode assistants/packages/agent-runtime/.stryker-tmp/sandbox-xgAkYD



 ❯ src/utils/__tests__/safe-stringify.test.ts (29 tests | 5 failed) 20ms

       ✓ should return null as-is 1ms
       ✓ should return undefined as-is 0ms

[Killed] BlockStatement
src/utils/safe-stringify.ts:89:6
 		return arg
 	}
 
-	try {
-		const safe = safeStringify(arg)
-		return JSON.stringify(safe)
-	} catch (_error) {
+	try {} catch (_error) {
 		// Fallback if even safe stringify fails
 		return "[Unable to stringify]"
killedBy: All tests
statusReason: RUN  v4.0.17 C:/Users/echernyavsky/Documents/AlfaCode assistants/packages/agent-runtime/.stryker-tmp/sandbox-xgAkYD



 ❯ src/utils/__tests__/safe-stringify.test.ts (29 tests | 6 failed) 21ms

       ✓ should return null as-is 1ms
       ✓ should return undefined as-is 0ms

[Killed] BlockStatement
src/utils/safe-stringify.ts:92:19
 	try {
 		const safe = safeStringify(arg)
 		return JSON.stringify(safe)
-	} catch (_error) {
-		// Fallback if even safe stringify fails
-		return "[Unable to stringify]"
-	}
+	} catch (_error) {}
 }
 
killedBy: All tests
statusReason: RUN  v4.0.17 C:/Users/echernyavsky/Documents/AlfaCode assistants/packages/agent-runtime/.stryker-tmp/sandbox-xgAkYD



 ❯ src/utils/__tests__/safe-stringify.test.ts (29 tests | 1 failed) 18ms
       ✓ should return null as-is 1ms
       ✓ should return undefined as-is 0ms
       ✓ should return strings as-is 0ms

[Killed] StringLiteral
src/utils/safe-stringify.ts:94:10
 		return JSON.stringify(safe)
 	} catch (_error) {
 		// Fallback if even safe stringify fails
-		return "[Unable to stringify]"
+		return ""
 	}
 }
killedBy: All tests
statusReason: RUN  v4.0.17 C:/Users/echernyavsky/Documents/AlfaCode assistants/packages/agent-runtime/.stryker-tmp/sandbox-xgAkYD



 ❯ src/utils/__tests__/safe-stringify.test.ts (29 tests | 1 failed) 28ms

       ✓ should return null as-is 3ms
       ✓ should return undefined as-is 0ms

[Killed] BlockStatement
src/utils/safe-stringify.ts:101:56
 /**
  * Convert multiple arguments to a single string message, handling circular references
  */
-export function argsToMessage(args: unknown[]): string {
-	return args.map(argToString).join(" ")
-}
+export function argsToMessage(args: unknown[]): string {}
 
killedBy: All tests
statusReason: RUN  v4.0.17 C:/Users/echernyavsky/Documents/AlfaCode assistants/packages/agent-runtime/.stryker-tmp/sandbox-xgAkYD



 ❯ src/utils/__tests__/safe-stringify.test.ts (29 tests | 3 failed) 18ms
       ✓ should return null as-is 1ms
       ✓ should return undefined as-is 0ms
       ✓ should return strings as-is 0ms
